Revit 2027 API
IFCHybridImportOptions.ToString(IFCHybridImportOptions) Method
 Converts the IFCHybridImportOptions class to a revit.ini-compatible string.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string ToString(
	IFCHybridImportOptions options
)
Public Shared Function ToString (
	options As IFCHybridImportOptions
) As String
public:
static String^ ToString(
	IFCHybridImportOptions^ options
)
static member ToString :
        options : IFCHybridImportOptions -> string
Parameters
options IFCHybridImportOptions
 The optional IFCHybridImportOptions class.
Return Value
String
 The options string.
Remarks
 A null IFCHybridImportOptions will assume that this is a legacy import.
See Also
Reference
IFCHybridImportOptions Class
ToString Overload
Autodesk.Revit.DB.IFC Namespace